/* c2pad h8sampleledDETAIL */

Ver(2.00)
{
	"2026/10/20";
}


void 初期化(void)
{
	変数の宣言と初期化;
	実行時オプション「点灯パターン」「点滅モード」「点滅周期」（「- N」「- F」「- B」「- DEBUG」）の読み取り;
	実行時オプション「- N」「- F」「- B」「- DEBUG」の表示;
	H8ポートの初期化;
	タイマー0の初期化(「0.1秒相当のコンペアマッチ」, 「点灯・点滅の判断・実行を行う関数」);
	点灯パターンを設定する(点灯パターン);
	点滅モードを設定する(点滅モード);
	点滅周期を設定する(点滅周期);
}

void 終了処理(void)
{
	タイマー0の停止;
	停止する();
  LEDを点灯する（消灯パターン);
  数値LEDを消灯する();
}

int main(int argc, char **argv)
{
	初期化();
	while (1)
	{
		プッシュスイッチP50およびP51の両方が押されていたらbreakする;
		プッシュスイッチP51が押されていたらモードを「回転」に設定;
		プッシュスイッチP50が押されていたらモードを「停止」に設定;
		モードとスイッチP53の値によってモーターの正転・逆転・停止を制御;
		エンコーダー値 = エンコーダー値を取得する();
		回転数 = エンコーダー値をもとにモーターの回転方向を検出し、回転数を算出する;
		数値LEDを表示する(回転数);
		点灯パターンを設定する(点灯パターン);
		if (デバッグモード) {
			mcountの値を表示する();
		}
	}
	終了処理();
	使い方を表示する;
	return 0;
}
